In [1]:
import pandas as pd
#import matplotlib as plt

In [2]:
my_data = {'Name': ['Emma','Olivia','Liam','James','Frank', 'Bob'],
          'City': ['Kent','Seattle', 'Chicago', 'Boston', 'New York','Evanston'],
          'Age':[19, 25, 29, 24, 21, 27]
          }
my_df = pd.DataFrame(my_data)

In [3]:
my_df.head()

     Name      City  Age
0    Emma      Kent   19
1  Olivia   Seattle   25
2    Liam   Chicago   29
3   James    Boston   24
4   Frank  New York   21

In [4]:
my_df.tail()

     Name      City  Age
1  Olivia   Seattle   25
2    Liam   Chicago   29
3   James    Boston   24
4   Frank  New York   21
5     Bob  Evanston   27

In [6]:
my_df.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
my_df['Name']

0      Emma
1    Olivia
2      Liam
3     James
4     Frank
5       Bob
Name: Name, dtype: object

In [9]:
my_df.loc[0]

Name    Emma
City    Kent
Age       19
Name: 0, dtype: object

In [10]:
my_data2 = [ {'Name': 'Emma', 'Age': 19, 'City': 'Kent'},
    {'Name': 'Olivia', 'Age': 25, 'City': 'Seattle'},
    {'Name': 'Liam', 'Age': 29, 'City': 'Chicago'},
    {'Name': 'James', 'Age': 24, 'City': 'Boston'},
    {'Name': 'Frank', 'Age': 21, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 27, 'City': 'Evanston'}
]
my_df2 = pd.DataFrame(my_data2)

In [11]:
my_df2.head()

     Name  Age      City
0    Emma   19      Kent
1  Olivia   25   Seattle
2    Liam   29   Chicago
3   James   24    Boston
4   Frank   21  New York

In [12]:
my_df.to_csv('/Users/nemoby/Desktop/FA24-Data/my_dataframe.csv', index=False)

## What does the "write/render/evaluate" loop provide for creators of interactive data visualizations?
This process encourages experimentation and immediate feedback, enableing creators to iteratively develop and refine data visializations. Thus, creators are able to design a very engaging and dynamic visuals for their audiences.
## Why are dynamic, interactive data visualizations useful when communicating data?
It is challenging to fairly represent multidimensional data in static images because the number of dimensions creators can show at once is very limited. Dynamic, interactive data visualizations would allow users to engage with the data deeply by filtering information and zooming in on area of their interest in a more exploratory way, leading to a improved decision-making.
## Do you agree with Murray's claim that open-source tools that avoid proprietary software are best for publishing data visualization? In a few sentences, explain why you do or do not agree.
Yes, I agree with Murray's claim. Unlike proprietary software which is tied to specific platforms and licenses, open-source tools could offer a broder audience better flexibility, accessibility, and transparency. In detail, audiences are able to access, modify, and share visualizations without constraints. Also, open-source communities forster innovation, keeping them with the latest advancements